frontend/controllers/InsightController.php

SELECT * FROM `comments` WHERE (`insight_id`='1') AND (`parent_id`=0) AND (`status`=1) ORDER BY `created_at` DESC
SELECT * FROM `comments` WHERE (`comment_author`=2) AND (`insight_id`='1') AND (`parent_id`=0) AND (`status`=0) ORDER BY `created_at` DESC
SELECT * FROM `comments` WHERE (`parent_id`=1) AND (`status`=1) ORDER BY `created_at`
SELECT * FROM `comments` WHERE (`comment_author`=2) AND (`parent_id`=1) AND (`status`=0)
---
    public function actionView($id)
    {
		$comments = Comment::find()->where(['insight_id'=>$id,'parent_id'=>0, 'status'=>1])->orderBy('created_at DESC')->all();
		if(!\Yii::$app->user->isGuest){
			$user_comments = Comment::find()->where(['comment_author'=>\Yii::$app->user->id,'insight_id'=>$id,'parent_id'=>0, 'status'=>0])->orderBy('created_at DESC')->all();
			$comments = (object) array_merge( (array)$comments, (array)$user_comments );
		}

		foreach($comments as $comment){
			$threads = Comment::find()->where(['parent_id'=>$comment->c_id,'status'=>1])->orderBy('created_at ASC')->all();
				 if(!\Yii::$app->user->isGuest){
					$user_comments = Comment::find()->where(['comment_author'=>\Yii::$app->user->id,'parent_id'=>$comment->c_id, 'status'=>0])->all();

SELECT * FROM `insights` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Insight::findOne($id)) !== null) {