frontend/controllers/ProfileController.php

    protected function findModel($id)
    {
        if (($model = Profile::find()->where(['user_id'=>$id])->one()) !== null) {
---
SELECT * FROM `user_profile` WHERE `user_id`='1'