common/models/User.php

SELECT * FROM `user` WHERE (`id`=2) AND (`status`=10)
SELECT * FROM `user_profile` WHERE `user_id`=2
---
    public static function findIdentity($id)
    {
		$user = static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
        $profile = UserProfile::find()->where(['user_id'=>$id])->one();