common/modules/social/controllers/TwitterController.php

   public function insertRecord($result){

		$model=new User();
		$profile=new Profile();
		$model->username='tw_'.$result['id'];
		//to check already present or not
		 $user = User::find()->where(['username'=>$model->username])->one();
---
SELECT * FROM `user` WHERE `username`='tw_3433980017'